app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by_email(params[:email])
---
SELECT * FROM `users` WHERE (`users`.`email` = 'aboobackervyd@gmail.com') LIMIT 1

  def update
    @user.password = params[:password]
    @user.password_confirmation = params[:password_confirmation]
    # Only if your are using password confirmation
    # @user.password_confirmation = params[:password]

    # Use @user.save_without_session_maintenance instead if you
    # don't want the user to be signed in automatically.
    if @user.save
---
UPDATE `users` SET `crypted_password` = 'eaca21901511eaac98a92639feb5243f2c2e0f03c46ab77854faf4bfeaae1f52aa8f7e4d00aeaeb82842ce0aa04a5ee36ec1032c4df36931e5db39da19e7ee08', `password_salt` = 'j228Iy6kSbPiZS89dKF', `updated_at` = '2014-11-25 07:55:48', `perishable_token` = 'MOhQBNDIL7jrVprnc2L', `persistence_token` = 'd7a5cbf2f40a190fe721267ed8225c820e1657dc65c0ca1373074eea9c496c4a24bf04fc6ada66064dc92afefa3f2ff845375070b06d3166a21ef6bd627324cb' WHERE `id` = 1

  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])
---
SELECT * FROM `users` WHERE (perishable_token = 'H6gapdeGc4AzTwBavOGJ' and updated_at > '2014-11-25 07:45:47') LIMIT 1