app/controllers/tasks_controller.rb

  def create
  	@task=Task.new(params[:user])
    @task.user_id=@user.id;
    if @task.save
---
INSERT INTO `tasks` (`position`, `status`, `name`, `created_at`, `updated_at`, `user_id`) VALUES(NULL, 0, 'add', '2014-11-25 08:21:57', '2014-11-25 08:21:57', 2)

  def index
  	#@tasks=@user.tasks
    if @user
      @tasks=@user.tasks.reverse.paginate(:page => params[:page], :per_page => 8)
---
SELECT * FROM `tasks` WHERE (position < 1 and user_id=2 ) ORDER BY tasks.id DESC LIMIT 1
SELECT count(*) AS count_all FROM `tasks` WHERE (`tasks`.user_id = 2)

  def task_list
    @tasks=@user.tasks.reverse.paginate(:page => params[:page], :per_page => 8)
---
SELECT * FROM `tasks` WHERE (position < 18 and user_id=2 ) ORDER BY tasks.id DESC LIMIT 1

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 199)
DELETE FROM `tasks` WHERE `id` = 199

  def change_status
    p params.inspect
    @task = Task.find(params[:task][:id])
    p "Status=#{@task.status}"
    if @task.status==false
      @task.status=true
    else
      @task.status=false
    end
    if @task.save
---
SELECT * FROM `tasks` WHERE (position < 8 and user_id=2 ) ORDER BY tasks.id DESC LIMIT 1
UPDATE `tasks` SET `status` = 1, `updated_at` = '2014-11-21 05:40:19' WHERE `id` = 213

  def move_down
    @id=params[:task][:id]
    @task = @user.tasks.find(@id)
    @up_task=@task.previous
    p "Current task #{@task.id}, uptask: #{@up_task.id}"
    if @task && @up_task
      @task_id=@task.id;
      @uptask_id=@up_task.id;
      #Model.update_all({:id => new_id}, {:id => old_id})
      Task.update_all({:id => -1}, {:id => @uptask_id})
      Task.update_all({:id => -2}, {:id => @task_id})
      Task.update_all({:id => @uptask_id}, {:id => -2})
      Task.update_all({:id => @task_id}, {:id => -1})

      # p @task
      if @task.save! && @up_task.save!
---
SELECT * FROM `tasks` WHERE (position < 3 and user_id=2 ) ORDER BY tasks.id DESC LIMIT 1
UPDATE `tasks` SET `updated_at` = '2014-11-25 08:34:53', `position` = 7 WHERE `id` = 8
UPDATE `users` SET `last_request_at` = '2014-11-25 07:37:20', `updated_at` = '2014-11-25 07:37:20', `perishable_token` = 'TPsx7qZC03x9ifVN7fyq' WHERE `id` = 23

  def move_up
    @id=params[:task][:id]
    @task = @user.tasks.find(@id)
    @next_task=@task.next
    #p "Current task #{@task.id}, uptask: #{@up_task.id}"
    if @task && @next_task
      @task_id=@task.id;
      @nexttask_id=@next_task.id;
      #Model.update_all({:id => new_id}, {:id => old_id})
      Task.update_all({:id => -1}, {:id => @nexttask_id})
      Task.update_all({:id => -2}, {:id => @task_id})
      Task.update_all({:id => @nexttask_id}, {:id => -2})
      Task.update_all({:id => @task_id}, {:id => -1})

      # p @task
      if @task.save! && @next_task.save!
---
SELECT * FROM `tasks` WHERE (position < 3 and user_id=2 ) ORDER BY tasks.id DESC LIMIT 1
UPDATE `tasks` SET `updated_at` = '2014-11-25 08:59:09', `position` = 8 WHERE `id` = 4
UPDATE `users` SET `last_request_at` = '2014-11-25 07:35:47', `updated_at` = '2014-11-25 07:35:47', `perishable_token` = '1XSgHquwHA2qhNtKjMI' WHERE `id` = 23

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (position < 1 and user_id=2 ) ORDER BY tasks.id DESC LIMIT 1