app/controllers/tasks_controller.rb

  def create
  	@task=Task.new(params[:user])
    @task.user_id=@user.id;
    if @task.save!
      @task=@user.shared_tasks.all(:select => "DISTINCT(task_shares.task_id),task_shares.position,tasks.*",:joins => 'INNER  JOIN task_shares ts  ON task_shares.task_id = tasks.id',:conditions => "tasks.id = #{@task.id} and task_shares.user_id=#{@user.id}")
---
SELECT * FROM `tasks` WHERE (position < 1 and user_id=2 ) ORDER BY tasks.id DESC LIMIT 1

  def move_down
    @position=params[:task][:position]
    @task = Task.find_task_by_position_and_user_id(@position,@user.id)
---
SELECT * FROM `tasks` WHERE (`tasks`.`position` = '3') AND (`tasks`.user_id = 2) LIMIT 1

  def move_up
    @position=params[:task][:position]
    @task = Task.find_task_by_position_and_user_id(@position,@user.id)
---
SELECT * FROM `tasks` WHERE (`tasks`.`position` = '4') AND (`tasks`.user_id = 2) LIMIT 1

  def show
    @users=User.all
    @accessible_tasks=@user.shared_tasks.all(:select => "DISTINCT(task_shares.task_id),task_shares.position,tasks.*",:joins => 'INNER  JOIN task_shares ts  ON task_shares.task_id = tasks.id',:order => "task_shares.position")
    # @task = @accessible_tasks[params[:id].to_i]
    @task=@accessible_tasks.detect{|x| x.task_id==params[:id]}
    # @task = @user.sharedtasks.find(params[:id])
    @shared_users=Task.find_by_id(params[:id]).shared_users
---
SELECT * FROM `users` WHERE (`users`.`id` = '23') LIMIT 1