app/controllers/user_verifications_controller.rb

SELECT * FROM `users` WHERE (perishable_token = 'RWPS51RMk0yYXGADjn' and updated_at > '2014-11-25 07:43:54') LIMIT 1
---
  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])