app/controllers/users_controller.rb

INSERT INTO `users` (`perishable_token`, `crypted_password`, `login_count`, `name`, `created_at`, `verified`, `password_salt`, `failed_login_count`, `last_login_ip`, `updated_at`, `email`, `last_request_at`, `current_login_at`, `last_login_at`, `persistence_token`, `current_login_ip`) VALUES('JrYSLYpepqCpv6oT6TkV', 'f41ad477f477ff1414681b2e86bb8bc217efe9be238e53987dc42aceee8b66cbc4eaad1457ce290b509fea2dcdafdf940f220babb976433e3ac61ddef3638d20', 0, 'Aboobacker', '2014-11-25 07:53:31', 0, 'rTNnwHq0APM6qUYeQ57B', 0, NULL, '2014-11-25 07:53:31', 'aboobackervyd@gmail.com', NULL, NULL, NULL, '4e938c52590f62bc4cf918d388080036ae0af550feb0ab37fdbdd52ad2e286f83d6bb459e7347a8879ef92a95fff46ebfcb6e821dbd3efbea727b71158211cff', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `perishable_token` = 'G9MChn71KhbsKPyOihcU', `last_request_at` = '2014-11-25 11:17:27', `updated_at` = '2014-11-25 11:17:27' WHERE `id` = 2
---
  def change_password
    @user = current_user
    if request.post?
      @user.password = params[:user][:password]
      @user.password_confirmation = params[:user][:password_confirmation]
      if @user.changed? && @user.save